## Plan Result (1112: sbox_aria - Terraform Plan Apply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 24 to change, 21 to destroy.</code></pre>

* Create
  * local_file.config[&#34;00&#34;]
  * local_file.config[&#34;01&#34;]
  * local_file.config[&#34;02&#34;]
* Update
  * azurerm_linux_function_app.example[&#34;00-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-td&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-td&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-td&#34;]
  * azurerm_storage_account.zcutting[&#34;00&#34;]
  * azurerm_storage_account.zcutting[&#34;01&#34;]
  * azurerm_storage_account.zcutting[&#34;02&#34;]
* Delete
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-aplfpa&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-aplfta&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-apluta&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-bails&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-joh&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-sbails&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-td&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;01-af-aplfpa&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;01-af-aplfta&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;01-af-apluta&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;01-af-bails&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;01-af-joh&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;01-af-sbails&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;01-af-td&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;02-af-aplfpa&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;02-af-aplfta&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;02-af-apluta&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;02-af-bails&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;02-af-joh&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;02-af-sbails&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;02-af-td&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_access_policy.example-principal["00-af-aplfpa"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/objectId/6be63684-e1ec-470b-8a16-ab1337c0252c" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox" -> null
      - object_id               = "6be63684-e1ec-470b-8a16-ab1337c0252c" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["00-af-aplfta"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/objectId/4fbddc51-9662-4343-bdd0-570fc950e0ed" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox" -> null
      - object_id               = "4fbddc51-9662-4343-bdd0-570fc950e0ed" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["00-af-apluta"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/objectId/1789119f-88ac-4ce6-8716-7b4e684d182e" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox" -> null
      - object_id               = "1789119f-88ac-4ce6-8716-7b4e684d182e" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["00-af-bails"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/objectId/72e6893c-9d79-465b-b173-0e0eea285b3d" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox" -> null
      - object_id               = "72e6893c-9d79-465b-b173-0e0eea285b3d" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["00-af-joh"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/objectId/7cdc9deb-7bc6-41d4-ae37-eb284db52480" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox" -> null
      - object_id               = "7cdc9deb-7bc6-41d4-ae37-eb284db52480" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["00-af-sbails"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/objectId/a49b42dd-164a-433a-b2e7-72acaffe4e7b" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox" -> null
      - object_id               = "a49b42dd-164a-433a-b2e7-72acaffe4e7b" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["00-af-td"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/objectId/318b507a-008b-4225-88b3-166c226afe88" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox" -> null
      - object_id               = "318b507a-008b-4225-88b3-166c226afe88" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["01-af-aplfpa"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.KeyVault/vaults/ingest01-meta002-sbox/objectId/d8689332-e3e9-41c6-a279-21fdd669f357" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.KeyVault/vaults/ingest01-meta002-sbox" -> null
      - object_id               = "d8689332-e3e9-41c6-a279-21fdd669f357" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["01-af-aplfta"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.KeyVault/vaults/ingest01-meta002-sbox/objectId/d73f24a5-5e34-4152-8c3c-8c8221876dc2" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.KeyVault/vaults/ingest01-meta002-sbox" -> null
      - object_id               = "d73f24a5-5e34-4152-8c3c-8c8221876dc2" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["01-af-apluta"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.KeyVault/vaults/ingest01-meta002-sbox/objectId/7ceaa6ba-ffd1-4263-9ee9-7f18e5ae37d7" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.KeyVault/vaults/ingest01-meta002-sbox" -> null
      - object_id               = "7ceaa6ba-ffd1-4263-9ee9-7f18e5ae37d7" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["01-af-bails"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGro

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-bails-sbox01-uks-dlrm-01"
        name                                           = "af-bails-sbox01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-joh"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-joh-sbox01-uks-dlrm-01"
        name                                           = "af-joh-sbox01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-sbails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-sbails-sbox01-uks-dlrm-01"
        name                                           = "af-sbails-sbox01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-td"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/sites/af-td-sbox01-uks-dlrm-01"
        name                                           = "af-td-sbox01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["02-af-aplfpa"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-aplfpa-sbox02-uks-dlrm-01"
        name                                           = "af-aplfpa-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["02-af-aplfta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-aplfta-sbox02-uks-dlrm-01"
        name                                           = "af-aplfta-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["02-af-apluta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-apluta-sbox02-uks-dlrm-01"
        name                                           = "af-apluta-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["02-af-bails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-bails-sbox02-uks-dlrm-01"
        name                                           = "af-bails-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["02-af-joh"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-joh-sbox02-uks-dlrm-01"
        name                                           = "af-joh-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["02-af-sbails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-sbails-sbox02-uks-dlrm-01"
        name                                           = "af-sbails-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["02-af-td"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-td-sbox02-uks-dlrm-01"
        name                                           = "af-td-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_storage_account.zcutting["00"] will be updated in-place
  ~ resource "azurerm_storage_account" "zcutting" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00zcuttingsbox"
        name                               = "ingest00zcuttingsbox"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = (known after apply)
          + default_action = "Allow"
          + ip_rules       = (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_account.zcutting["01"] will be updated in-place
  ~ resource "azurerm_storage_account" "zcutting" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest01zcuttingsbox"
        name                               = "ingest01zcuttingsbox"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = (known after apply)
          + default_action = "Allow"
          + ip_rules       = (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_account.zcutting["02"] will be updated in-place
  ~ resource "azurerm_storage_account" "zcutting" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest02zcuttingsbox"
        name                               = "ingest02zcuttingsbox"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = (known after apply)
          + default_action = "Allow"
          + ip_rules       = (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # local_file.config["00"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "00"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_00.json"
      + id                   = (known after apply)
    }

  # local_file.config["01"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "01"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_01.json"
      + id                   = (known after apply)
    }

  # local_file.config["02"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "02"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_02.json"
      + id                   = (known after apply)
    }

Plan: 3 to add, 24 to change, 21 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":167,"Program":"tfcmt","SHA1":"","Target":"1112: sbox_aria - Terraform Plan Apply","Vars":{}} -->